jshen45/STM32F107VC_Bootloader/scr/Lcd/stm3210x_9325_lcd.c
/**
 9325 spi液晶底层函数
 Includes ------------------------------------------------------------------*/
#include "stm3210x_9325_lcd.h"
#include "fonts.h"
#include "touch_7846.h"

/** @addtogroup Utilities
  * @{
  */
  
/** @defgroup STM3210C_EVAL_LCD 
  * @brief This file includes the LCD driver for AM-240320L8TNQW00H (LCD_ILI9320)
  *        Liquid Crystal Display Module of STM3210C-EVAL board.
  * @{
  */ 

/** @defgroup STM3210C_EVAL_LCD_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM3210C_EVAL_LCD_Private_Defines
  * @{
  */ 
#define START_BYTE      0x70
#define SET_INDEX       0x00
#define READ_STATUS     0x01
#define LCD_WRITE_REG   0x02
#define LCD_READ_REG    0x03
/**
  * @}
  */ 


/** @defgroup STM3210C_EVAL_LCD_Private_Macros
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM3210C_EVAL_LCD_Private_Variables
  * @{
  */ 
  /* Global variables to set the written text color */
static  __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;
/**
  * @}
  */ 


/** @defgroup STM3210C_EVAL_LCD_Private_FunctionPrototypes
  * @{
  */ 
#ifndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
/**
  * @}
  */ 


/** @defgroup STM3210C_EVAL_LCD_Private_Functions
  * @{
  */ 


/**
  * @brief  Setups the LCD.
  * @param  None
  * @retval None
  */
void LCD_Setup(void)
{ 
/* Configure the LCD Control pins --------------------------------------------*/
  LCD_CtrlLinesConfig();
  
// Configure the LCD_SPI interface ----------------------------------------------*/
  LCD_SPIConfig();
  _delay_(5); /* Delay 50 ms */
  //* Start Initial Sequence ------------------------------------------------*
  LCD_WriteReg(R229, 0x8000); //* Set the internal vcore voltage *
  LCD_WriteReg(R0,  0x0001); //* Start internal OSC. *
  LCD_WriteReg(R1,  0x0100); //* set SS and SM bit *
  LCD_WriteReg(R2,  0x0700); //* set 1 line inversion *
  LCD_WriteReg(R3,  0x1030); //* set GRAM write direction and BGR=1. *
  LCD_WriteReg(R4,  0x0000); //* Resize register *
  LCD_WriteReg(R8,  0x0202); //* set the back porch and front porch *
  LCD_WriteReg(R9,  0x0000); //* set non-display area refresh cycle ISC[3:0] *
  LCD_WriteReg(R10, 0x0000); //* FMARK function *
  LCD_WriteReg(R12, 0x0000); //* RGB interface setting *
  LCD_WriteReg(R13, 0x0000); //* Frame marker Position *
  LCD_WriteReg(R15, 0x0000); //* RGB interface polarity *
  //* Power On sequence -----------------------------------------------------*
  LCD_WriteReg(R16, 0x0000); //* SAP, BT[3:0], AP, DSTB, SLP, STB *
  LCD_WriteReg(R17, 0x0000); //* DC1[2:0], DC0[2:0], VC[2:0] *
  LCD_WriteReg(R18, 0x0000); //* VREG1OUT voltage *
  LCD_WriteReg(R19, 0x0000); //* VDV[4:0] for VCOM amplitude *
  _delay_(20);                 //* Dis-charge capacitor power voltage (200ms) *
  LCD_WriteReg(R16, 0x17B0); //* SAP, BT[3:0], AP, DSTB, SLP, STB *
  LCD_WriteReg(R17, 0x0137); //* DC1[2:0], DC0[2:0], VC[2:0] *
  _delay_(5);                  //* Delay 50 ms *
  LCD_WriteReg(R18, 0x0139); //* VREG1OUT voltage *
  _delay_(5);                  //* Delay 50 ms *
  LCD_WriteReg(R19, 0x1d00); //* VDV[4:0] for VCOM amplitude *
  LCD_WriteReg(R41, 0x0013); //* VCM[4:0] for VCOMH *
  _delay_(5);                  //* Delay 50 ms *
  LCD_WriteReg(R32, 0x0000); //* GRAM horizontal Address *
  LCD_WriteReg(R33, 0x0000); //* GRAM Vertical Address *
  //* Adjust the Gamma Curve ------------------------------------------------*
  LCD_WriteReg(R48, 0x0006);
  LCD_WriteReg(R49, 0x0101);
  LCD_WriteReg(R50, 0x0003);
  LCD_WriteReg(R53, 0x0106);
  LCD_WriteReg(R54, 0x0b02);
  LCD_WriteReg(R55, 0x0302);
  LCD_WriteReg(R56, 0x0707);
  LCD_WriteReg(R57, 0x0007);
  LCD_WriteReg(R60, 0x0600);
  LCD_WriteReg(R61, 0x020b);
  
  //* Set GRAM area ---------------------------------------------------------
  LCD_WriteReg(R80, 0x0000); //* Horizontal GRAM Start Address 
  LCD_WriteReg(R81, 0x00EF); //* Horizontal GRAM End Address 
  LCD_WriteReg(R82, 0x0000); //* Vertical GRAM Start Address 
  LCD_WriteReg(R83, 0x013F); //* Vertical GRAM End Address 
  LCD_WriteReg(R96,  0xa700); //* Gate Scan Line 
  LCD_WriteReg(R97,  0x0001); //* NDL,VLE, REV 
  LCD_WriteReg(R106, 0x0000); //* set scrolling line 
  //* Partial Display Control -----------------------------------------------
  LCD_WriteReg(R128, 0x0000);
  LCD_WriteReg(R129, 0x0000);
  LCD_WriteReg(R130, 0x0000);
  LCD_WriteReg(R131, 0x0000);
  LCD_WriteReg(R132, 0x0000);
  LCD_WriteReg(R133, 0x0000);
  //* Panel Control ---------------------------------------------------------
  LCD_WriteReg(R144, 0x0010);
  LCD_WriteReg(R146, 0x0000);
  LCD_WriteReg(R147, 0x0003);
  LCD_WriteReg(R149, 0x0110);
  LCD_WriteReg(R151, 0x0000);
  LCD_WriteReg(R152, 0x0000);
  //* Set GRAM write direction and BGR = 1 
  //* I/D=01 (Horizontal : increment, Vertical : decrement) 
  //* AM=1 (address is updated in vertical writing direction) 
  LCD_WriteReg(R3, 0x1018);
  LCD_WriteReg(R7, 0x0173); /* 262K color and display ON */		  
			 
LCD_SetBackColor(Black);
LCD_SetTextColor(White); 
LCD_Clear(Blue);
}

/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void STM3210C_LCD_Init(void)
{
  /* Setups the LCD */
  LCD_Setup();
}


/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}


/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @retval None
  */
void LCD_ClearLine(uint8_t Line)
{
  LCD_DisplayStringLine(Line, "                    ");
}


/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
  uint32_t index = 0;
  
